<a href="https://colab.research.google.com/github/marcosmvgs/Water-quality-on-the-beaches-of-S-o-Paulo/blob/master/Quality_water_of_the_beaches_of_S%C3%A3o_Paulo.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Water quality on the beachs  of the coast of São Paulo 

*Qualidade da Água nas praias do litoral do Estado de São Paulo*
<center><img alt="beach" width="90%" src="https://raw.githubusercontent.com/marcosmvgs/Water-quality-on-the-beaches-of-S-o-Paulo/master/pngtree-yellow-beach-cartoon-ocean-taobao-travel-background-image_122125.jpg?token=AQNY3CALCGXFKL5ZZX74YQS7JGXO2"/></center>

**Context**

One criteria that can be used to measure the water quality of the beaches is the density of Enterococcus, which indicates the fecal pollution in water. High values of the density of this bacteria indicates that the water quality is compromised and it represents risks to the bathers health. The measurements are performed weekly in several beaches in the state of São Paulo and they are used to classify the beaches as 'Proper' or 'Improper' for bathing.
Content

**About the Data**

This data represents over 68k measurements of Enterococcus taken weekly between 2012 and 2020, from 16 cities and 168 beaches/collection points in the São Paulo state.

The original source of the data was provided by [CETESB.!](https://cetesb.sp.gov.br/)

In order to represent the statistics in a map i decided to include the coordinates of each beach in the Data as it will be seen along the notebook.

**Goals** 

1. Check ammount of *Enterococcus* along the years and analyze if it has improved or not;
2. Check if the vacations or holidays have some relation in the quality of the water;
3. Plot on a map the beaches and the ammount of Enterococcus colected in each of them.

Importing libraries
1. Pandas
2. Plotly.express

In [29]:
import pandas as pd
import plotly.express as px

Reading de Data

In [16]:
df = pd.read_csv('/content/sp_beaches.csv', parse_dates=['Date'])
df.head()

       City                    Beach       Date  Enterococcus
0  BERTIOGA  BORACÉIA - COL. MARISTA 2012-01-03             8
1  BERTIOGA  BORACÉIA - COL. MARISTA 2012-01-08            22
2  BERTIOGA  BORACÉIA - COL. MARISTA 2012-01-15            17
3  BERTIOGA  BORACÉIA - COL. MARISTA 2012-01-22             8
4  BERTIOGA  BORACÉIA - COL. MARISTA 2012-01-29             2

Checking the information about the Data

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 68481 entries, 0 to 68480
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   City          68481 non-null  object
 1   Beach         68481 non-null  object
 2   Date          68481 non-null  datetime64[ns]
 3   Enterococcus  68481 non-null  int64
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 2.1+ MB

We can see above that:
* There's no null's
* All columns have the right Dtype, including Date column

So our data is well organized

## 1st Goal

- [ ] Check ammount of *Enterococcus* along the years and analyze if it has improved or not

First of all, let's check the last Date and the first Date in order to verify if we have measures of all year long.

In [18]:
df['Date'].min()

Timestamp('2012-01-03 00:00:00')

In [19]:
df['Date'].max()

Timestamp('2020-03-15 00:00:00')

As we don't have data for all 2020 year. We will exclude this year of our data and will analyze from 2012 until 2019. We also will remove Columns `<City>` and `<'Beach'>` because they're not interesting for us now.

In [20]:
years = df.loc[:, 'Date':'Enterococcus'] #Selecting Date and Enterococcus columns
years.head()

        Date  Enterococcus
0 2012-01-03             8
1 2012-01-08            22
2 2012-01-15            17
3 2012-01-22             8
4 2012-01-29             2

Once the days and months doesn't interest for us now it's necessary to group the data by year. In the following code I grouped the data by year showing the mean of Enterococcus in each year, transformed the data in Dataframe (it was a Series before) and reseted index. As follows:

In [21]:
years = years.groupby(df['Date'].dt.year)['Enterococcus'].mean().to_frame().reset_index() 
years

   Date  Enterococcus
0  2012     62.251473
1  2013     78.583716
2  2014     63.626992
3  2015     52.185566
4  2016     45.088246
5  2017     47.187976
6  2018     61.265351
7  2019     60.802781
8  2020     84.797149

Now it's easy to select just the rows that are interesting for the analysis.

In [22]:
years = years.iloc[0:8, 0:3] #Selecting lines 0 to 7 in order to exclude 2020
years

   Date  Enterococcus
0  2012     62.251473
1  2013     78.583716
2  2014     63.626992
3  2015     52.185566
4  2016     45.088246
5  2017     47.187976
6  2018     61.265351
7  2019     60.802781

**Ploting the data**

Now with our data organized it's easy to plot the graph

In [ ]:
fig1 = px.bar(years, x='Date', y='Enterococcus', color='Enterococcus',
              title='Year vs Enterococcus mean per year', color_continuous_scale= px.colors.sequential.Viridis_r)
print(fig1.show())

<img alt="fig1" width="80%" src="https://raw.githubusercontent.com/marcosmvgs/Water-quality-on-the-beaches-of-S-o-Paulo/master/newplot.png">

*According with CETESB criteria for sea water: the Enterococcus density greater than 100 UFC/100ml, in two or more samples of a set of five weeks or values greater than 400UFC/100ml in the last sample,  characterize the impropriety of beach for primary contact recreation.*

---
**1st Goal Reached**

- [x] **Check ammount of *Enterococcus* along the years and analyze if it has improved or not**

> Analyzing the graph above we can see that along the years the Enterococcus mean is about 45 UFC/100ml and 78 UFC/100ml. From 2013 until 2016 the amount of Enterococcus was decreasing every year, but in 2018 and 2019 increased.

> The Enterococcus mean was about the same along the 8 years of analysis, so there were no improvements that worked and there was no major worsening either.

## 2nd Goal

- [ ] Check if the vacations or holidays have some relation with the the quality of the water.

Vacations in Brazil are usually in the months of **June - 06**, **July - 07**, **December - 12**, **January - 01** and **February - 02**

I will analyze the data by month, so it's necessary to get the data together by month

In [24]:

months = df.groupby(df['Date'].dt.month)['Enterococcus'].mean().to_frame().reset_index() 
months

    Date  Enterococcus
0      1     87.823974
1      2     73.097324
2      3     70.216661
3      4     53.766667
4      5     46.969393
5      6     54.194493
6      7     47.642638
7      8     50.503696
8      9     49.778595
9     10     47.975452
10    11     59.584970
11    12     62.943396

Creating the graph required

In [ ]:
fig2 = px.bar(months, x = 'Date', y = 'Enterococcus', 
              title = 'Enterococcus mena per month', color= 'Enterococcus', 
              color_continuous_scale= px.colors.sequential.Viridis_r)
fig2.show()

<img alt="fig1" width="80%" src="https://raw.githubusercontent.com/marcosmvgs/Water-quality-on-the-beaches-of-S-o-Paulo/master/fig2.png">

**2nd Goal Reached**

- [x] **Check if the vacations or holidays have some relation with the the quality of the water.**

> Analyzing the graph above we can see that in the months from December to March, especially January the levels os Enterococcus is much higher than the others. This coincides with the most used months for vacation but also coincides with the most rainy months in the year. See the graph below acquired at this [link!](https://pt.climate-data.org/america-do-sul/brasil/sao-paulo/sao-paulo-655/#climate-table) showing the months vs precipitation.


<center><img src="https://images.climate-data.org/location/655/climate-graph.png" width="600" height="400" /></center>

We can see that precipitaion is higher basically at the same months that we have high values of Enterococcus, it show us that the amount of Enterococcus at the beaches increases due a lot of reasons. Vacation concentrate more people at the beaches, and the problem of the rain is that clandestine sewage connections galleries and rivers and streams are guided to the sea taking with them all the trash making the beach become contamined and inaproprietaded for bath

## 3th Goal

- [ ] Plot on a map the beaches and the ammount of Enterococcus colected in each of them. 

Since we need the coordinates of each beach to create a map, I took them in google maps and create a new dataframe with two aditional columns, lat and long, in xlsx format.

In [26]:
latlon = pd.read_excel('/content/sp_beaches_latlon(1).xlsx', parse_dates=True)
latlon.head()

   Unnamed: 0             Beach  ...        lat        lon
0           0  AGENOR DE CAMPOS  ... -24.133046 -46.691516
1           1         APARECIDA  ... -23.983527 -46.310940
2           2           ARMAÇÃO  ... -23.738485 -45.345435
3           3          ARRASTÃO  ... -23.771381 -45.402686
4           4          ASTÚRIAS  ... -24.006466 -46.268172

[5 rows x 6 columns]

Ploting a Scatter map.

Below is ploted a mapbox graph so we can see that the bigger and darker the circle the more polluted the water is.

In [ ]:

fig3 = px.scatter_mapbox(latlon, lat="lat", lon="lon", hover_name="City", size='Enterococcus', color='Enterococcus', size_max= 50,
                        color_continuous_scale= px.colors.sequential.Inferno_r, zoom=8, height=500)
fig3.update_layout(mapbox_style="open-street-map")
fig3.update_layout(margin={"r":10,"t":10,"l":0,"b":0})
fig3.show()

<img alt="fig1" width="80%" src="https://raw.githubusercontent.com/marcosmvgs/Water-quality-on-the-beaches-of-S-o-Paulo/master/fig3.png">

Just another type of graph

In [ ]:
fig4 = px.scatter_mapbox(latlon, lat="lat", lon="lon", hover_name="City", size='Enterococcus', color='Enterococcus', size_max= 50,
                        color_continuous_scale= px.colors.sequential.solar_r, zoom=8, height=500)
fig4.update_layout(
    mapbox_style="white-bg",
    mapbox_layers=[
        {
            "below": 'traces',
            "sourcetype": "raster",
            "source": [
                "https://basemap.nationalmap.gov/arcgis/rest/services/USGSImageryOnly/MapServer/tile/{z}/{y}/{x}"
            ]
        }
      ])
fig4.update_layout(margin={"r":0,"t":0,"l":0,"b":0})
fig4.show()

<img alt="fig1" width="80%" src="https://raw.githubusercontent.com/marcosmvgs/Water-quality-on-the-beaches-of-S-o-Paulo/master/fig4.png">

It's important to say that **the conclusions that I had along this data analysis doesn't reflect the reality necessarily** and should not be used for other thing otherwise in order to learn more about the language. 

This was my first notebook in kaggle, I'm begginer in python language and Data Science so I hope this notebook help others beginners too. 

I will be so thankful for all the coments, critics etc...

*Bye!*

---